Prácticas/bateriaPruebasP4/haproxy/Haproxy_ab_4.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ubuntu03-b (be patient)


Server Software:        Apache/2.2.22
Server Hostname:        ubuntu03-b
Server Port:            80

Document Path:          /hola.html
Document Length:        47 bytes

Concurrency Level:      5
Time taken for tests:   3.193 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      322500 bytes
HTML transferred:       47000 bytes
Requests per second:    313.14 [#/sec] (mean)
Time per request:       15.967 [ms] (mean)
Time per request:       3.193 [ms] (mean, across all concurrent requests)
Transfer rate:          98.62 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      1       5
Processing:     7   15   3.8     14      32
Waiting:        6   13   3.6     13      32
Total:          7   16   3.8     15      33

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     17
  75%     18
  80%     19
  90%     21
  95%     24
  98%     26
  99%     27
 100%     33 (longest request)