Prácticas/bateriaPruebasP4/haproxy/Haproxy_ab_9.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ubuntu03-b (be patient)


Server Software:        Apache/2.2.22
Server Hostname:        ubuntu03-b
Server Port:            80

Document Path:          /hola.html
Document Length:        47 bytes

Concurrency Level:      5
Time taken for tests:   3.157 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      322500 bytes
HTML transferred:       47000 bytes
Requests per second:    316.72 [#/sec] (mean)
Time per request:       15.787 [ms] (mean)
Time per request:       3.157 [ms] (mean, across all concurrent requests)
Transfer rate:          99.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      1       8
Processing:     7   14   4.0     13      38
Waiting:        6   13   3.4     13      38
Total:          8   16   4.0     15      40

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     16
  75%     18
  80%     18
  90%     21
  95%     23
  98%     25
  99%     28
 100%     40 (longest request)