Prácticas/bateriaPruebasP4/haproxy/Haproxy_siege_3.txt
** SIEGE 3.0.5
** Preparing 15 concurrent users for battle.
The server is now under siege...

Lifting the server siege...      done.

Transactions:		       20589 hits
Availability:		      100.00 %
Elapsed time:		       59.98 secs
Data transferred:	        1.16 MB
Response time:		        0.04 secs
Transaction rate:	      343.26 trans/sec
Throughput:		        0.02 MB/sec
Concurrency:		       14.94
Successful transactions:       20589
Failed transactions:	           0
Longest transaction:	        0.28
Shortest transaction:	        0.00