Prácticas/bateriaPruebasP4/haproxy/Haproxy_siege_7.txt
\** SIEGE 3.0.5
** Preparing 15 concurrent users for battle.
The server is now under siege...

Lifting the server siege...      done.

Transactions:		       19737 hits
Availability:		      100.00 %
Elapsed time:		       59.97 secs
Data transferred:	        1.11 MB
Response time:		        0.05 secs
Transaction rate:	      329.11 trans/sec
Throughput:		        0.02 MB/sec
Concurrency:		       14.94
Successful transactions:       19737
Failed transactions:	           0
Longest transaction:	        0.54
Shortest transaction:	        0.00