Prácticas/bateriaPruebasP4/haproxy/Haproxy_siege_9.txt
** SIEGE 3.0.5
** Preparing 15 concurrent users for battle.
The server is now under siege...

Lifting the server siege...      done.

Transactions:		       19996 hits
Availability:		      100.00 %
Elapsed time:		       59.96 secs
Data transferred:	        1.13 MB
Response time:		        0.04 secs
Transaction rate:	      333.49 trans/sec
Throughput:		        0.02 MB/sec
Concurrency:		       14.95
Successful transactions:       19996
Failed transactions:	           0
Longest transaction:	        0.65
Shortest transaction:	        0.00